### Pandas loc and iloc

In [1]:
import pandas as pd
df = pd.read_csv('C:\\Users\\sunid\\Machine Learning\\Pandas\\student_result2.csv')
df

   Student ID  Class  Study hrs  Free hrs  Percantege
0        1001     10          2         3          50
1        1002     10          6         2          80
2        1003     10          3         2          60
3        1004     11          0         1          45
4        1005     12          5         2          75

In [2]:
df.loc[0]

Student ID    1001
Class           10
Study hrs        2
Free hrs         3
Percantege      50
Name: 0, dtype: int64

In [3]:
df.loc[4]

Student ID    1005
Class           12
Study hrs        5
Free hrs         2
Percantege      75
Name: 4, dtype: int64

In [4]:
df.loc[[2,4]]

   Student ID  Class  Study hrs  Free hrs  Percantege
2        1003     10          3         2          60
4        1005     12          5         2          75

In [5]:
df.loc[2:4]     # 4 is inclusive

   Student ID  Class  Study hrs  Free hrs  Percantege
2        1003     10          3         2          60
3        1004     11          0         1          45
4        1005     12          5         2          75

In [6]:
df.loc[4, 'Study hrs']

5

In [7]:
df.loc[2:4, 'Class']

2    10
3    11
4    12
Name: Class, dtype: int64

In [8]:
df.loc[[False, False, True, True, False]]

   Student ID  Class  Study hrs  Free hrs  Percantege
2        1003     10          3         2          60
3        1004     11          0         1          45

In [9]:
df.loc[df['Class'] < 11]

   Student ID  Class  Study hrs  Free hrs  Percantege
0        1001     10          2         3          50
1        1002     10          6         2          80
2        1003     10          3         2          60

In [10]:
df.loc[df['Class'] < 11, ['Percantege']]

   Percantege
0          50
1          80
2          60

### iloc

In [11]:
df.iloc[0]

Student ID    1001
Class           10
Study hrs        2
Free hrs         3
Percantege      50
Name: 0, dtype: int64

In [12]:
df.iloc[[0]]

   Student ID  Class  Study hrs  Free hrs  Percantege
0        1001     10          2         3          50

In [13]:
df.iloc[:,0]

0    1001
1    1002
2    1003
3    1004
4    1005
Name: Student ID, dtype: int64

In [14]:
df.iloc[0:2, 2:4]

   Study hrs  Free hrs
0          2         3
1          6         2

In [16]:
df.iloc[[True, False, True, False, False]]

   Student ID  Class  Study hrs  Free hrs  Percantege
0        1001     10          2         3          50
2        1003     10          3         2          60